{
  "recipes": [
    {
      "id": 1,
      "name": "Potato Sauté",
      "category": "breakfast",
      "description": "Crispy golden potatoes sautéed with onions and spices.",
      "image": "Assets/potato_saute.jpg",
      "steps": [
        "Peel and dice the potatoes.",
        "Heat oil in a pan and add the potatoes.",
        "Add the onions and spices.",
        "Cook until the potatoes are golden brown.",
        "Garnish with fresh coriander leaves and serve hot."
      ]
    },
    {
      "id": 2,
      "name": "Scrambled Eggs",
      "category": "breakfast",
      "description": "Fluffy scrambled eggs with butter and herbs.",
      "image": "Assets/eggs.jpg",
      "steps": [
        "Beat the eggs in a bowl.",
        "Heat butter in a pan and add the eggs.",
        "Add the herbs and spices.",
        "Cook until the eggs are fluffy.",
        "Serve hot with toast."
      ]
    },
    {
      "id": 3,
      "name": "Arrow roots",
      "category": "breakfast",
      "description": "Boiled or roasted arrow roots, rich in flavor and nutrients.",
      "image": "Assets/arrow_roots.jpg",
      "steps": [
        "Peel the arrow roots and cut into small pieces.",
        "Boil in salted water until soft.",
        "Drain the water and serve hot."
      ]
    },
    {
      "id": 4,
      "name": "Sweet Tea",
      "category": "breakfast",
      "description": "Warm, sweet, and refreshing Kenyan-style tea.",
      "image": "Assets/tea.jpg",
      "steps": [
        "Put sugar in a pan and add little water.",
        "Stir slowly on low heat until the sugar caramelizes.",
        "Add tea leaves, cardamom, and freshly crushed ginger.",
        "Stir, then add milk and water once the aroma oozes.",
        "Increase heat and let it boil until ready to serve."
      ]
    },
    {
      "id": 5,
      "name": "Coconut Fish",
      "category": "lunch",
      "description": "Fish cooked in a creamy coconut sauce with spices.",
      "image": "Assets/coconut_fish.jpg",
      "steps": [
        "Clean the fish and marinate with salt.",
        "Fry the fish until golden brown.",
        "In a separate pan, heat onions, crushed garlic, tomatoes, and rosemary.",
        "Stir until the tomatoes are soft and paste-like or blend them.",
        "Add a bit of water and coconut milk and stir.",
        "Add the fish and cook until the sauce thickens.",
        "Garnish with fresh coriander leaves and serve hot."
      ]
    },
    {
      "id": 6,
      "name": "Wet Fried Liver",
      "category": "lunch",
      "description": "Tender liver cooked in a rich tomato-based sauce.",
      "image": "Assets/liver.jpg",
      "steps": [
        "Clean your liver with vinegar and water.",
        "Drain and add into a pan with hot oil.",
        "Add a teaspoon of salt and any other spices you like.",
        "Fry until slightly brown.",
        "Add chopped onions and tomatoes and stir.",
        "Add a little water and let it simmer until the sauce thickens.",
        "Garnish with fresh herbs and serve hot."
      ]
    },
    {
      "id": 7,
      "name": "Traditional Chicken",
      "category": "lunch",
      "description": "Authentic Kenyan-style chicken slow-cooked in traditional spices.",
      "image": "Assets/chicken.jpeg",
      "steps": [
        "Char the chicken on a grill before cutting.",
        "Clean the chicken and marinate with salt and spices.",
        "Cook in a pressure cooker for 10 minutes.",
        "Separate the chicken from the stock and fry until slightly brown.",
        "Add chopped onions, garlic, ginger, and tomatoes and stir on low heat.",
        "Add the chicken stock and let it simmer until the sauce thickens.",
        "Garnish with fresh coriander leaves and serve hot."
      ]
    },
    {
      "id": 8,
      "name": "Deep Fried Fish",
      "category": "lunch",
      "description": "Crispy golden deep-fried fish served with fresh kachumbari.",
      "image": "Assets/fried_fish.jpeg",
      "steps": [
        "Clean the fish and marinate with salt and spices.",
        "Fry the fish until golden brown.",
        "Serve hot with kachumbari and brown ugali."
      ]
    },
    {
      "id": 9,
      "name": "Vegetable Rice",
      "category": "dinner",
      "description": "Rice cooked with assorted vegetables and aromatic spices.",
      "image": "Assets/vegetable_rice.jpg",
      "steps": [
        "Wash your rice and soak for 30 minutes.",
        "Boil until ready to serve.",
        "In a separate pan, heat oil and add the chopped onions, garlic and stir until golden brown.",
        "Add your slightly boiled (with sugar) carrots, peas, and green beans.",
        "Stir-fry for 5-6 minutes on medium heat.",
        "Add the rice in bits as you stir until well mixed.",
        "Garnish with fresh coriander leaves and serve hot."
      ]
    },
    {
      "id": 10,
      "name": "Carrot Chapattis",
      "category": "dinner",
      "description": "Soft chapattis infused with grated carrots for extra flavor.",
      "image": "Assets/chapattis.jpg",
      "steps": [
        "Mix flour with grated carrots, salt, and two pinches of sugar.",
        "Add warm water and oil in bits, kneading until the dough is soft.",
        "Let it rest for 30 minutes.",
        "Roll out the dough and cook on a hot pan until slightly brown.",
        "Serve hot with your favorite stew."
      ]
    },
    {
      "id": 11,
      "name": "Mini Cardamom Mandazis",
      "category": "sweet-treats",
      "description": "Small, spiced mandazis with a hint of cardamom.",
      "image": "Assets/mini_mandazis.jpg",
      "steps": [
        "Mix flour with baking powder, sugar, cardamom, and a pinch of salt.",
        "Add warm water or milk and knead until the dough is soft.",
        "Let it rest overnight or for 5 hours.",
        "Roll out the dough and cut into small pieces.",
        "Deep fry until golden brown.",
        "Serve hot with sweet tea or coffee."
      ]
    },
    {
      "id": 12,
      "name": "Cookies",
      "category": "sweet-treats",
      "description": "Crunchy, homemade cookies with a soft center.",
      "image": "Assets/cookies.jpg",
      "steps": [
        "Mix two well-beaten eggs with baking powder, sugar, cinnamon, vanilla essence, and a pinch of salt.",
        "Add flour in bits, kneading until the dough is soft.",
        "Let it rest for 30 minutes.",
        "Preheat the oven to 180°C.",
        "Roll out the dough and cut into small pieces.",
        "Bake for 25 minutes until golden brown.",
        "Serve hot with sweet tea or coffee."
      ]
    }
  ]
}
